import React from "react";
import "./Disclaimer.scss";

export default function Disclaimer() {
  return (
    <>
      <div className="disclaimer__container">
        <h3 className="disclaimer__context">
          任何访问、使用、查阅本网站所载信息、资料的人士（以下简称“您”）在访问本网站之前，请务必仔细阅读本条款并同意本声明。您进入、访问或使用本网站的行为，都将被视作是对本声明全部内容的无异议的认可；如您不同意下列条款，请勿进入、访问或使用本网站或其任何信息。
          “本网站”指由本公司Blockmind Technologies Limited
          所有并发布的本网站（www.elitehousecn.com）及其包含的所有信息及材料。
          <br />
          1、本网站所载信息和资料的来源皆被本公司视为真实、可靠，且本公司尽力严谨处理本网站所载信息和资料，但本公司对该等信息资料的真实性、准确性、完整性及其使用的适当性等不作任何担保。
          <br />
          2、本网站所载信息和资料仅供一般性参考，除非另有明确协议，不应被视为购买或销售任何金融产品的某种要约或要约邀请，亦非对任何交易的正式确认。本网站介绍的信息和资料不作为任何形式的建议。基金投资有风险，基金的过往业绩并不预示其未来表现，您在作出投资决策前应认真阅读基金招募说明书以及本公司在中国证监会指定信息披露媒体上发布的正式公告和有关信息，并自行承担投资风险。
          <br />
          3、本公司将采取最大限度的措施以保护您的资料和交易活动的安全，但并不就本网站各项服务的安全、无误及不中断承担任何明示或默示的保证责任。您应当自行承担使用本网站服务的所有风险（如传输错误、技术缺陷、第三者侵入等）及因该等风险可能造成的任何损害，对于因该等风险而导致的任何损失，本公司不承担任何责任。
          <br />
          4、本公司为向您提供更优质的服务，可能会根据具体业务的需要收集您的相关信息，并有可能将相关信息提供给与本公司联合提供服务的合作伙伴，本公司及本公司的合作伙伴将依照有关法律法规，采取各种严格的措施确保该等信息安全不受侵犯，避免任何人（包括本公司员工）未经授权而取得您的个人资料，但在法律法规规定或司法机关、监管机构及其他有权机关提出要求的情况下，本公司有可能向有权机关提供您的相关信息。
          <br />
          5、本网站的内容将定期更新或修正，但本公司对网站所载或所涉及的信息和资料的及时性不作任何担保或保证，本公司保留无需事先通知即可删除或修改网站信息的权利。
          <br />
          6、除非存在欺诈行为，本公司及其股东、分支机构、关联企业、董事、员工对于因您进入、访问或使用本网站，或无法进入、访问或使用本网站而可能对您造成的任何直接或间接损失，不承担任何责任。
          <br />
          7、本网站所载信息资料受版权保护，未经本公司事前书面同意，任何人不得对此等信息资料的整体或任何部分内容进行修改、复制、转发或以任何其它方式用于商业用途。对于侵犯本公司合法利益之行为，本公司保留追究相关方责任的权利。
          <br />
          8、本网站有部分内容来自互联网，如该等内容无意中侵犯了某相关方合法拥有的知识产权，请来电或致函告知并提供相关证明材料，本网站会在核实无误后于规定时间内进行删除或作其他相关处理。
          <br />
          9、您进入、访问与使用本网站的行为，皆为您的责任。在进入本站前，访客需了解本身所在地的法规，以免触犯当地有关法规。如有问题，请离开本站，本网站不对任何使用者的行为负任何责任。
          <br />
          10、本声明的最终解释权归本公司所有，本公司有权不时对本声明的内容进行更改或调整。
        </h3>
      </div>
    </>
  );
}
